[
  {
    "question_text_en": "From when to when does an agent drink an object whose width is less than or equal to 0.44m in the livingroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:drink .\n                    \n                    ?event vh2kg:mainObject ?object .\n                    ?state vh2kg:isStateOf ?object ;\n                        vh2kg:bbox ?shape .\n                    ?shape x3do:bboxSize ?size .\n                    ?size rdf:first ?size_x .\n                    filter(?size_x <= 0.44)\n                \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"livingroom\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T13:00:54"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T13:01:05"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "Size",
    "query_pattern_Object_value": [
      0.44,
      "<=",
      "x"
    ],
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "drink",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "livingroom",
      "object": "an object whose width is less than or equal to 0.44m",
      "action": "drink",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "When did the agent drink from an object that is 0.44 meters wide or less in the living room?"
  },
  {
    "question_text_en": "From when to when does an agent open an object which is a subclass of Appliances in the kitchen?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:open .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Appliances .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"kitchen\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-14T19:00:49"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-14T19:00:52"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Appliances",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "open",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "kitchen",
      "object": "an object which is a subclass of Appliances",
      "action": "open",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "From when to when did the agent open an appliance in the kitchen?"
  },
  {
    "question_text_en": "What is the time when an agent texts an object which is a subclass of Props in the livingroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:text .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"livingroom\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-14T10:01:29"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Instant",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "text",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "livingroom",
      "object": "an object which is a subclass of Props",
      "action": "text",
      "question": "What is the time?"
    },
    "paraphrased_question_text_en": "What time did the agent text a prop in the living room?"
  },
  {
    "question_text_en": "What is the time when an agent wipes an object which is a subclass of Props in the livingroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:wipe .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"livingroom\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T07:01:18"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Instant",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "wipe",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "livingroom",
      "object": "an object which is a subclass of Props",
      "action": "wipe",
      "question": "What is the time?"
    },
    "paraphrased_question_text_en": "What time did the agent wipe a prop in the living room?"
  },
  {
    "question_text_en": "How long does an agent take to write while in the living room with an object whose state is GRABED?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:write .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"livingroom\" .\n                \n                    \n                    ?event vh2kg:time ?time .\n                    ?time time:numericDuration ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#decimal",
          "type": "literal",
          "value": "10.419"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Duration",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "write",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "livingroom",
      "object": "an object whose state is GRABED",
      "action": "write",
      "question": "How long?"
    },
    "paraphrased_question_text_en": "How long did it take for the agent to write while in the living room with an object that was held?"
  },
  {
    "question_text_en": "From when to when does an agent find an object whose state is GRABED in the kitchen?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:find .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"kitchen\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-02T14:00:12"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-02T14:00:15"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "find",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "kitchen",
      "object": "an object whose state is GRABED",
      "action": "find",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "From when to when did the agent hold an object in the kitchen?"
  },
  {
    "question_text_en": "How long does an agent take to write with an object whose state is GRABED in the livingroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:write .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"livingroom\" .\n                \n                    \n                    ?event vh2kg:time ?time .\n                    ?time time:numericDuration ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#decimal",
          "type": "literal",
          "value": "10.419"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Duration",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "write",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "livingroom",
      "object": "an object whose state is GRABED",
      "action": "write",
      "question": "How long?"
    },
    "paraphrased_question_text_en": "How long did it take for the agent to write with a held object in the living room?"
  },
  {
    "question_text_en": "From when to when does an agent wipe an object which is a subclass of Props inside the livingroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:wipe .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    } }\n                    \n                    ?event vh2kg:mainObject ?object .\n                    \n                ?event vh2kg:situationAfterEvent ?situation .\n                ?state vh2kg:partOf ?situation .\n                ?state vh2kg:isStateOf ?object .\n                ?state vh2kg:bbox ?shape .\n                ?shape vh2kg:inside ?shape2 .\n                ?state2 vh2kg:bbox ?shape2 ;\n                    vh2kg:isStateOf ?object2 .\n                ?object2 rdfs:label \"livingroom\" .\n            \n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T07:01:18"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T07:01:38"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "wipe",
    "query_pattern_Space_type": "Relation",
    "query_pattern_Space_value": [
      "inside",
      "livingroom"
    ],
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "inside the livingroom",
      "object": "an object which is a subclass of Props",
      "action": "wipe",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "What was the time frame during which the agent wiped a prop in the living room?"
  },
  {
    "question_text_en": "From when to when does an agent soak an object whose state is GRABED in the bathroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:soak .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"bathroom\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T08:01:08"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T08:01:22"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "soak",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bathroom11_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "bathroom",
      "object": "an object whose state is GRABED",
      "action": "soak",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "From when to when did the agent soak the object they were holding in the bathroom?"
  },
  {
    "question_text_en": "From when to when does an agent eat an object whose state is GRABED in the kitchen?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:eat .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"kitchen\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T11:00:27"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T11:00:37"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "eat",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "kitchen",
      "object": "an object whose state is GRABED",
      "action": "eat",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "From when to when did the agent eat a food item he was holding in the kitchen?"
  }
]