[
  {
    "question_text_en": "What is the place where an agent soaks an object whose state is GRABED lastly?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:soak .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bathroom11_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "soak",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Last",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "lastly",
      "space": "",
      "object": "an object whose state is GRABED",
      "action": "soak",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "What is the last location where the agent soaked an object that was being held?"
  },
  {
    "question_text_en": "What is the place where an agent lastly wipes an object which is a subclass of Props?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:wipe .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "wipe",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Last",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "lastly",
      "space": "",
      "object": "an object which is a subclass of Props",
      "action": "wipe",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent last wipe a prop?"
  },
  {
    "question_text_en": "What is the place where an agent lastly drinks an object whose height is less than or equal to 0.89m?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:drink .\n                    \n                    ?event vh2kg:mainObject ?object .\n                    ?state vh2kg:isStateOf ?object ;\n                        vh2kg:bbox ?shape .\n                    ?shape x3do:bboxSize ?size .\n                    ?size rdf:rest/rdf:first ?size_y .\n                    filter(?size_y <= 0.89)\n                \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Size",
    "query_pattern_Object_value": [
      0.89,
      "<=",
      "y"
    ],
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "drink",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Last",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "lastly",
      "space": "",
      "object": "an object whose height is less than or equal to 0.89m",
      "action": "drink",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent last drink from an object that was 0.89 meters tall or shorter?"
  },
  {
    "question_text_en": "What is the place where an agent opens an object which is a subclass of Appliances from 2024-05-22T01:17:00 to 2024-06-14T22:37:00?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:open .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Appliances .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasBeginning ?begin .\n                ?begin time:inXSDDateTime ?begin_time .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n                FILTER(\"2024-05-22T01:17:00\"^^xsd:dateTime <= ?begin_time && ?end_time <= \"2024-06-14T22:37:00\"^^xsd:dateTime)\n            \n                    }  }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Appliances",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "open",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Interval",
    "query_pattern_Time_value": [
      "2024-05-22T01:17:00",
      "2024-06-14T22:37:00"
    ],
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": "<= <=",
    "qualifiers_en": {
      "subject": "agent",
      "time": "from 2024-05-22T01:17:00 to 2024-06-14T22:37:00",
      "space": "",
      "object": "an object which is a subclass of Appliances",
      "action": "open",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent open an appliance from 1:17 a.m. on May 22, 2024, to 10:37 p.m. on June 14, 2024?"
  },
  {
    "question_text_en": "What is the place where an agent sits on an object whose depth is greater than or equal to 0.6m firstly?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:sit .\n                    \n                    ?event vh2kg:mainObject ?object .\n                    ?state vh2kg:isStateOf ?object ;\n                        vh2kg:bbox ?shape .\n                    ?shape x3do:bboxSize ?size .\n                    ?size rdf:rest/rdf:rest/rdf:first ?size_z .\n                    filter(?size_z >= 0.6)\n                \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasBeginning ?begin .\n                ?begin time:inXSDDateTime ?begin_time .\n            \n                    } order by asc(?begin_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bedroom75_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Size",
    "query_pattern_Object_value": [
      0.6,
      ">=",
      "z"
    ],
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "sit",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "First",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": "<= <=",
    "qualifiers_en": {
      "subject": "agent",
      "time": "firstly",
      "space": "",
      "object": "an object whose depth is greater than or equal to 0.6m",
      "action": "sit",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent first sit on an object with a depth of at least 0.6 meters?"
  },
  {
    "question_text_en": "What is the place where an agent currently wipes an object whose state is GRABED?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:wipe .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "wipe",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Current",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": "<= <=",
    "qualifiers_en": {
      "subject": "agent",
      "time": "currently",
      "space": "",
      "object": "an object whose state is GRABED",
      "action": "wipe",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where is the agent currently wiping an object that is being held?"
  },
  {
    "question_text_en": "What is the place where an agent lastly shakes an object whose depth is greater than or equal to 0.83m?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:shake .\n                    \n                    ?event vh2kg:mainObject ?object .\n                    ?state vh2kg:isStateOf ?object ;\n                        vh2kg:bbox ?shape .\n                    ?shape x3do:bboxSize ?size .\n                    ?size rdf:rest/rdf:rest/rdf:first ?size_z .\n                    filter(?size_z >= 0.83)\n                \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Size",
    "query_pattern_Object_value": [
      0.83,
      ">=",
      "z"
    ],
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "shake",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Last",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": "<= <",
    "qualifiers_en": {
      "subject": "agent",
      "time": "lastly",
      "space": "",
      "object": "an object whose depth is greater than or equal to 0.83m",
      "action": "shake",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent last shake an object that was at least 0.83 meters deep?"
  },
  {
    "question_text_en": "What is the place where an agent scrubs an object whose state is GRABED for more than or equal to 15 seconds?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:scrub .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    \n                ?event vh2kg:time ?time_duration .\n                ?time_duration time:numericDuration ?duration .\n                FILTER(?duration >= 15)\n            \n                    }  }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bathroom11_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "scrub",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Duration",
    "query_pattern_Time_value": 15,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": ">=",
    "qualifiers_en": {
      "subject": "agent",
      "time": "more than or equal to 15 seconds",
      "space": "",
      "object": "an object whose state is GRABED",
      "action": "scrub",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent scrub an object that was held for at least 15 seconds?"
  },
  {
    "question_text_en": "What is the place where an agent is currently shaking an object which is a subclass of Props?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:shake .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bedroom75_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "shake",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Current",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": "<= <",
    "qualifiers_en": {
      "subject": "agent",
      "time": "currently",
      "space": "",
      "object": "an object which is a subclass of Props",
      "action": "shake",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where is the agent currently shaking a prop?"
  },
  {
    "question_text_en": "What is the place where an agent writes on an object whose state is GRABED firstly?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:write .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasBeginning ?begin .\n                ?begin time:inXSDDateTime ?begin_time .\n            \n                    } order by asc(?begin_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "write",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "First",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "firstly",
      "space": "",
      "object": "an object whose state is GRABED",
      "action": "write",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent first write on an object that was held by the agent?"
  },
  {
    "question_text_en": "What is the place where an agent lastly scrubs an object whose height is greater than or equal to 0.34m?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:scrub .\n                    \n                    ?event vh2kg:mainObject ?object .\n                    ?state vh2kg:isStateOf ?object ;\n                        vh2kg:bbox ?shape .\n                    ?shape x3do:bboxSize ?size .\n                    ?size rdf:rest/rdf:first ?size_y .\n                    filter(?size_y >= 0.34)\n                \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Size",
    "query_pattern_Object_value": [
      0.34,
      ">=",
      "y"
    ],
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "scrub",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Last",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "lastly",
      "space": "",
      "object": "an object whose height is greater than or equal to 0.34m",
      "action": "scrub",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent last scrub an object that was at least 0.34 meters tall?"
  }
]