[
  {
    "question_text_en": "From when to when is an agent brushing an object whose state is GRABED in the bathroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:brush .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"bathroom\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T08:00:45"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T08:01:03"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "brush",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bathroom11_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "bathroom",
      "object": "an object whose state is GRABED",
      "action": "brush",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "What is the timeframe during which the agent was brushing an object that was being held in the bathroom?"
  },
  {
    "question_text_en": "From when to when does an agent shake an object which is a subclass of Props in the bathroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:shake .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"bathroom\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-15T18:01:35"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-15T18:01:49"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "shake",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bathroom11_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "bathroom",
      "object": "an object which is a subclass of Props",
      "action": "shake",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "When did the agent shake a prop in the bathroom?"
  },
  {
    "question_text_en": "What is the time when an agent switches off an object which is a subclass of Appliances inside the kitchen?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:switchOff .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Appliances .\n            \n                    } }\n                    \n                    ?event vh2kg:mainObject ?object .\n                    \n                ?event vh2kg:situationAfterEvent ?situation .\n                ?state vh2kg:partOf ?situation .\n                ?state vh2kg:isStateOf ?object .\n                ?state vh2kg:bbox ?shape .\n                ?shape vh2kg:inside ?shape2 .\n                ?state2 vh2kg:bbox ?shape2 ;\n                    vh2kg:isStateOf ?object2 .\n                ?object2 rdfs:label \"kitchen\" .\n            \n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-14T19:01:03"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Instant",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Appliances",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "switchOff",
    "query_pattern_Space_type": "Relation",
    "query_pattern_Space_value": [
      "inside",
      "kitchen"
    ],
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "inside the kitchen",
      "object": "an object which is a subclass of Appliances",
      "action": "switchOff",
      "question": "What is the time?"
    },
    "paraphrased_question_text_en": "When did the agent turn off an appliance in the kitchen?"
  },
  {
    "question_text_en": "How long does an agent take to wipe an object whose state is GRABED in the bedroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:wipe .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"bedroom\" .\n                \n                    \n                    ?event vh2kg:time ?time .\n                    ?time time:numericDuration ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#decimal",
          "type": "literal",
          "value": "18.560999999999996"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Duration",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "wipe",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bedroom75_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "bedroom",
      "object": "an object whose state is GRABED",
      "action": "wipe",
      "question": "How long?"
    },
    "paraphrased_question_text_en": "How long did it take for the agent to wipe an object that was held in the bedroom?"
  },
  {
    "question_text_en": "From when to when does an agent close an object which is a subclass of Appliances in the kitchen?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:close .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Appliances .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"kitchen\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-14T19:00:55"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-14T19:00:58"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Appliances",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "close",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "kitchen",
      "object": "an object which is a subclass of Appliances",
      "action": "close",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "From when to when did the agent close an appliance in the kitchen?"
  },
  {
    "question_text_en": "What is the place where an agent firstly writes an object which is a subclass of Props?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:write .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasBeginning ?begin .\n                ?begin time:inXSDDateTime ?begin_time .\n            \n                    } order by asc(?begin_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "write",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "First",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "firstly",
      "space": "",
      "object": "an object which is a subclass of Props",
      "action": "write",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent first write on a prop?"
  },
  {
    "question_text_en": "What is the place where an agent lastly reads an object which is a subclass of Props?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:read .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bedroom75_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "read",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Last",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "lastly",
      "space": "",
      "object": "an object which is a subclass of Props",
      "action": "read",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent last read a prop?"
  },
  {
    "question_text_en": "What is the place where an agent currently opens an object whose state is ON?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:open .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:ON .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "ON",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "open",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Current",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "currently",
      "space": "",
      "object": "an object whose state is ON",
      "action": "open",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where is the agent currently opening an object that is on?"
  },
  {
    "question_text_en": "What is the place where an agent texts an object whose depth is less than or equal to 0.46m lastly?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:text .\n                    \n                    ?event vh2kg:mainObject ?object .\n                    ?state vh2kg:isStateOf ?object ;\n                        vh2kg:bbox ?shape .\n                    ?shape x3do:bboxSize ?size .\n                    ?size rdf:rest/rdf:rest/rdf:first ?size_z .\n                    filter(?size_z <= 0.46)\n                \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Size",
    "query_pattern_Object_value": [
      0.46,
      "<=",
      "z"
    ],
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "text",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Last",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "lastly",
      "space": "",
      "object": "an object whose depth is less than or equal to 0.46m",
      "action": "text",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent last text an object that is 0.46 meters deep or less?"
  },
  {
    "question_text_en": "What is the place where an agent currently brushes an object which is a subclass of Props?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:brush .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bathroom11_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "brush",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Current",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "currently",
      "space": "",
      "object": "an object which is a subclass of Props",
      "action": "brush",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where is the agent currently brushing a prop?"
  },
  {
    "question_text_en": "What is the place where an agent drinks an object whose state is GRABED lastly?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:drink .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    \n                ?event vh2kg:time ?time_interval .\n                ?time_interval time:hasEnd ?end .\n                ?end time:inXSDDateTime ?end_time .\n            \n                    } order by desc(?end_time) }\n                    ?event vh2kg:place ?answer .\n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "type": "uri",
          "value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1"
        }
      }
    ],
    "selected_answer_type": "Space",
    "selected_answer_type_metadata": "Place",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "drink",
    "query_pattern_Space_type": null,
    "query_pattern_Space_value": null,
    "query_pattern_Time_type": "Last",
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "lastly",
      "space": "",
      "object": "an object whose state is GRABED",
      "action": "drink",
      "question": "What is the place?"
    },
    "paraphrased_question_text_en": "Where did the agent last drink a beverage that was held?"
  }
]