[
  {
    "question_text_en": "From when to when does an agent wipe an object whose state is GRABED in the kitchen?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:wipe .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"kitchen\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-14T21:00:21"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-14T21:00:40"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "wipe",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "kitchen",
      "object": "an object whose state is GRABED",
      "action": "wipe",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "What is the time frame during which the agent wiped an object that was being held in the kitchen?"
  },
  {
    "question_text_en": "From when to when is an agent opening an object which is a subclass of Appliances in the kitchen?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:open .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Appliances .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"kitchen\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-14T19:00:49"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-14T19:00:52"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Appliances",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "open",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "kitchen",
      "object": "an object which is a subclass of Appliances",
      "action": "open",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "From when to when did the agent open an appliance in the kitchen?"
  },
  {
    "question_text_en": "How long does an agent take to write while holding an object whose state is GRABED in the livingroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:write .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"livingroom\" .\n                \n                    \n                    ?event vh2kg:time ?time .\n                    ?time time:numericDuration ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#decimal",
          "type": "literal",
          "value": "10.419"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Duration",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "write",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "livingroom",
      "object": "an object whose state is GRABED",
      "action": "write",
      "question": "How long?"
    },
    "paraphrased_question_text_en": "How long did it take for the agent to write while holding an object that was grabbed in the living room?"
  },
  {
    "question_text_en": "How long does it take for an agent to close an object whose state is ON in the kitchen?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:close .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:ON .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"kitchen\" .\n                \n                    \n                    ?event vh2kg:time ?time .\n                    ?time time:numericDuration ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#decimal",
          "type": "literal",
          "value": "3.3119999999999994"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Duration",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "ON",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "close",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "kitchen",
      "object": "an object whose state is ON",
      "action": "close",
      "question": "How long?"
    },
    "paraphrased_question_text_en": "How long did it take for the agent to close an object that was on in the kitchen?"
  },
  {
    "question_text_en": "How long does an agent shake an object whose state is GRABED in the bathroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:shake .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"bathroom\" .\n                \n                    \n                    ?event vh2kg:time ?time .\n                    ?time time:numericDuration ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#decimal",
          "type": "literal",
          "value": "14.075999999999999"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Duration",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "shake",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bathroom11_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "bathroom",
      "object": "an object whose state is GRABED",
      "action": "shake",
      "question": "How long?"
    },
    "paraphrased_question_text_en": "How long did the agent shake an object that was being held in the bathroom?"
  },
  {
    "question_text_en": "From when to when does an agent write on an object which is a subclass of Props in the living room?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:write .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"livingroom\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T10:01:05"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T10:01:16"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "write",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "livingroom",
      "object": "an object which is a subclass of Props",
      "action": "write",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "When does the agent write on a prop in the living room?"
  },
  {
    "question_text_en": "What is the time when an agent rinses an object whose state is GRABED in the bathroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:rinse .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"bathroom\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T08:01:22"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Instant",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "rinse",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bathroom11_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "bathroom",
      "object": "an object whose state is GRABED",
      "action": "rinse",
      "question": "What is the time?"
    },
    "paraphrased_question_text_en": "When did the agent rinse an object they were holding in the bathroom?"
  },
  {
    "question_text_en": "How long does an agent read an object which is a subclass of Props in the livingroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:read .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?object a ?objectType .\n                ?objectType rdfs:subClassOf vh2kg:Props .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"livingroom\" .\n                \n                    \n                    ?event vh2kg:time ?time .\n                    ?time time:numericDuration ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#decimal",
          "type": "literal",
          "value": "14.007"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Duration",
    "query_pattern_Object_type": "Class",
    "query_pattern_Object_value": "Props",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "read",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "livingroom",
      "object": "an object which is a subclass of Props",
      "action": "read",
      "question": "How long?"
    },
    "paraphrased_question_text_en": "How long did the agent read a prop in the living room?"
  },
  {
    "question_text_en": "What is the time when an agent squeezes an object whose state is GRABED in the bathroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:squeeze .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"bathroom\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T08:00:19"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Instant",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "squeeze",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/bathroom11_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "bathroom",
      "object": "an object whose state is GRABED",
      "action": "squeeze",
      "question": "What is the time?"
    },
    "paraphrased_question_text_en": "What time did the agent squeeze an object that was being held in the bathroom?"
  },
  {
    "question_text_en": "From when to when does an agent read an object whose state is GRABED in the livingroom?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?begin_time ?end_time WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:read .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"livingroom\" .\n                \n                    \n                    ?event vh2kg:time ?time_interval .\n                    ?time_interval time:hasBeginning ?begin .\n                    ?begin time:inXSDDateTime ?begin_time .\n                    ?time_interval time:hasEnd ?end .\n                    ?end time:inXSDDateTime ?end_time .\n                \n                } limit 1\n            ",
    "results": [
      {
        "begin_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T10:00:29"
        },
        "end_time": {
          "datatype": "http://www.w3.org/2001/XMLSchema#dateTime",
          "type": "literal",
          "value": "2024-04-12T10:00:43"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Interval",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "read",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/livingroom342_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "livingroom",
      "object": "an object whose state is GRABED",
      "action": "read",
      "question": "From when to when?"
    },
    "paraphrased_question_text_en": "What were the start and end times for when the agent read an object that was held in the living room?"
  },
  {
    "question_text_en": "How long does an agent pour an object whose state is GRABED in the kitchen?",
    "query": "\n                \n            PREFIX ho: <http://www.owl-ontologies.com/VirtualHome.owl#>\n            PREFIX mssn: <http://mssn.sigappfr.org/mssn/>\n            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n            PREFIX vh2kg: <http://kgrc4si.home.kg/virtualhome2kg/ontology/>\n            PREFIX ex: <http://kgrc4si.home.kg/virtualhome2kg/instance/>\n            PREFIX x3do: <https://www.web3d.org/specifications/X3dOntology4.0#>\n            PREFIX ac: <http://kgrc4si.home.kg/virtualhome2kg/ontology/action/>\n            PREFIX sosa: <http://www.w3.org/ns/sosa/>\n            PREFIX time: <http://www.w3.org/2006/time#>\n        \n                SELECT DISTINCT ?answer WHERE {\n                    { select * where {\n                    ?event vh2kg:action ac:pour .\n                    \n                ?event vh2kg:mainObject ?object .\n                ?state vh2kg:isStateOf ?object ;\n                    vh2kg:state vh2kg:GRABED .\n            \n                    } }\n                    \n                ?event vh2kg:place ?place .\n                ?place rdfs:label \"kitchen\" .\n                \n                    \n                    ?event vh2kg:time ?time .\n                    ?time time:numericDuration ?answer .\n                \n                } limit 1\n            ",
    "results": [
      {
        "answer": {
          "datatype": "http://www.w3.org/2001/XMLSchema#decimal",
          "type": "literal",
          "value": "16.284"
        }
      }
    ],
    "selected_answer_type": "Time",
    "selected_answer_type_metadata": "Duration",
    "query_pattern_Object_type": "State",
    "query_pattern_Object_value": "GRABED",
    "query_pattern_Action_type": "None",
    "query_pattern_Action_value": "pour",
    "query_pattern_Space_type": "Place",
    "query_pattern_Space_value": "http://kgrc4si.home.kg/virtualhome2kg/instance/kitchen209_scene1",
    "query_pattern_Time_type": null,
    "query_pattern_Time_value": null,
    "query_pattern_Space_operator": null,
    "query_pattern_Time_operator": null,
    "qualifiers_en": {
      "subject": "agent",
      "time": "",
      "space": "kitchen",
      "object": "an object whose state is GRABED",
      "action": "pour",
      "question": "How long?"
    },
    "paraphrased_question_text_en": "How long did the agent pour a beverage they were holding in the kitchen?"
  }
]